results/baseline/case-2/forte/recommendations/run-02/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/load/recommendations-ramp-strong.js
        output: -

     scenarios: (100.00%) 1 scenario, 90 max VUs, 3m15s max duration (incl. graceful stop):
              * ramp_load: Up to 90 looping VUs for 3m10s over 3 stages (gracefulRampDown: 5s, gracefulStop: 30s)


running (0m01.0s), 11/90 VUs, 84 complete and 0 interrupted iterations
ramp_load   [   1% ] 11/90 VUs  0m01.0s/3m10.0s

running (0m02.0s), 13/90 VUs, 184 complete and 0 interrupted iterations
ramp_load   [   1% ] 13/90 VUs  0m02.0s/3m10.0s

running (0m03.0s), 15/90 VUs, 320 complete and 0 interrupted iterations
ramp_load   [   2% ] 15/90 VUs  0m03.0s/3m10.0s

running (0m04.0s), 17/90 VUs, 466 complete and 0 interrupted iterations
ramp_load   [   2% ] 17/90 VUs  0m04.0s/3m10.0s

running (0m05.0s), 19/90 VUs, 620 complete and 0 interrupted iterations
ramp_load   [   3% ] 19/90 VUs  0m05.0s/3m10.0s

running (0m06.0s), 21/90 VUs, 794 complete and 0 interrupted iterations
ramp_load   [   3% ] 21/90 VUs  0m06.0s/3m10.0s

running (0m07.0s), 23/90 VUs, 989 complete and 0 interrupted iterations
ramp_load   [   4% ] 23/90 VUs  0m07.0s/3m10.0s

running (0m08.0s), 25/90 VUs, 1191 complete and 0 interrupted iterations
ramp_load   [   4% ] 25/90 VUs  0m08.0s/3m10.0s

running (0m09.0s), 27/90 VUs, 1423 complete and 0 interrupted iterations
ramp_load   [   5% ] 27/90 VUs  0m09.0s/3m10.0s

running (0m10.0s), 29/90 VUs, 1663 complete and 0 interrupted iterations
ramp_load   [   5% ] 29/90 VUs  0m10.0s/3m10.0s

running (0m11.0s), 31/90 VUs, 1913 complete and 0 interrupted iterations
ramp_load   [   6% ] 31/90 VUs  0m11.0s/3m10.0s

running (0m12.0s), 33/90 VUs, 2178 complete and 0 interrupted iterations
ramp_load   [   6% ] 33/90 VUs  0m12.0s/3m10.0s

running (0m13.0s), 35/90 VUs, 2457 complete and 0 interrupted iterations
ramp_load   [   7% ] 35/90 VUs  0m13.0s/3m10.0s

running (0m14.0s), 37/90 VUs, 2736 complete and 0 interrupted iterations
ramp_load   [   7% ] 37/90 VUs  0m14.0s/3m10.0s

running (0m15.0s), 39/90 VUs, 3029 complete and 0 interrupted iterations
ramp_load   [   8% ] 39/90 VUs  0m15.0s/3m10.0s

running (0m16.0s), 41/90 VUs, 3323 complete and 0 interrupted iterations
ramp_load   [   8% ] 41/90 VUs  0m16.0s/3m10.0s

running (0m17.0s), 43/90 VUs, 3612 complete and 0 interrupted iterations
ramp_load   [   9% ] 43/90 VUs  0m17.0s/3m10.0s

running (0m18.0s), 45/90 VUs, 3906 complete and 0 interrupted iterations
ramp_load   [   9% ] 45/90 VUs  0m18.0s/3m10.0s

running (0m19.0s), 47/90 VUs, 4188 complete and 0 interrupted iterations
ramp_load   [  10% ] 47/90 VUs  0m19.0s/3m10.0s

running (0m20.0s), 49/90 VUs, 4462 complete and 0 interrupted iterations
ramp_load   [  11% ] 49/90 VUs  0m20.0s/3m10.0s

running (0m21.0s), 51/90 VUs, 4760 complete and 0 interrupted iterations
ramp_load   [  11% ] 51/90 VUs  0m21.0s/3m10.0s

running (0m22.0s), 53/90 VUs, 5054 complete and 0 interrupted iterations
ramp_load   [  12% ] 53/90 VUs  0m22.0s/3m10.0s

running (0m23.0s), 55/90 VUs, 5342 complete and 0 interrupted iterations
ramp_load   [  12% ] 55/90 VUs  0m23.0s/3m10.0s

running (0m24.0s), 57/90 VUs, 5587 complete and 0 interrupted iterations
ramp_load   [  13% ] 57/90 VUs  0m24.0s/3m10.0s

running (0m25.0s), 59/90 VUs, 5866 complete and 0 interrupted iterations
ramp_load   [  13% ] 59/90 VUs  0m25.0s/3m10.0s

running (0m26.0s), 61/90 VUs, 6083 complete and 0 interrupted iterations
ramp_load   [  14% ] 61/90 VUs  0m26.0s/3m10.0s

running (0m27.0s), 63/90 VUs, 6297 complete and 0 interrupted iterations
ramp_load   [  14% ] 63/90 VUs  0m27.0s/3m10.0s

running (0m28.0s), 65/90 VUs, 6527 complete and 0 interrupted iterations
ramp_load   [  15% ] 65/90 VUs  0m28.0s/3m10.0s

running (0m29.0s), 67/90 VUs, 6768 complete and 0 interrupted iterations
ramp_load   [  15% ] 67/90 VUs  0m29.0s/3m10.0s

running (0m30.0s), 69/90 VUs, 7057 complete and 0 interrupted iterations
ramp_load   [  16% ] 69/90 VUs  0m30.0s/3m10.0s

running (0m31.0s), 71/90 VUs, 7358 complete and 0 interrupted iterations
ramp_load   [  16% ] 71/90 VUs  0m31.0s/3m10.0s

running (0m32.0s), 73/90 VUs, 7676 complete and 0 interrupted iterations
ramp_load   [  17% ] 73/90 VUs  0m32.0s/3m10.0s

running (0m33.0s), 75/90 VUs, 7962 complete and 0 interrupted iterations
ramp_load   [  17% ] 75/90 VUs  0m33.0s/3m10.0s

running (0m34.0s), 77/90 VUs, 8252 complete and 0 interrupted iterations
ramp_load   [  18% ] 77/90 VUs  0m34.0s/3m10.0s

running (0m35.0s), 79/90 VUs, 8514 complete and 0 interrupted iterations
ramp_load   [  18% ] 79/90 VUs  0m35.0s/3m10.0s

running (0m36.0s), 81/90 VUs, 8829 complete and 0 interrupted iterations
ramp_load   [  19% ] 81/90 VUs  0m36.0s/3m10.0s

running (0m37.0s), 83/90 VUs, 9140 complete and 0 interrupted iterations
ramp_load   [  19% ] 83/90 VUs  0m37.0s/3m10.0s

running (0m38.0s), 85/90 VUs, 9434 complete and 0 interrupted iterations
ramp_load   [  20% ] 85/90 VUs  0m38.0s/3m10.0s

running (0m39.0s), 87/90 VUs, 9727 complete and 0 interrupted iterations
ramp_load   [  21% ] 87/90 VUs  0m39.0s/3m10.0s

running (0m40.0s), 89/90 VUs, 10035 complete and 0 interrupted iterations
ramp_load   [  21% ] 89/90 VUs  0m40.0s/3m10.0s

running (0m41.0s), 90/90 VUs, 10321 complete and 0 interrupted iterations
ramp_load   [  22% ] 90/90 VUs  0m41.0s/3m10.0s

running (0m42.0s), 90/90 VUs, 10577 complete and 0 interrupted iterations
ramp_load   [  22% ] 90/90 VUs  0m42.0s/3m10.0s

running (0m43.0s), 90/90 VUs, 10894 complete and 0 interrupted iterations
ramp_load   [  23% ] 90/90 VUs  0m43.0s/3m10.0s

running (0m44.0s), 90/90 VUs, 11229 complete and 0 interrupted iterations
ramp_load   [  23% ] 90/90 VUs  0m44.0s/3m10.0s

running (0m45.0s), 90/90 VUs, 11532 complete and 0 interrupted iterations
ramp_load   [  24% ] 90/90 VUs  0m45.0s/3m10.0s

running (0m46.0s), 90/90 VUs, 11846 complete and 0 interrupted iterations
ramp_load   [  24% ] 90/90 VUs  0m46.0s/3m10.0s

running (0m47.0s), 90/90 VUs, 12130 complete and 0 interrupted iterations
ramp_load   [  25% ] 90/90 VUs  0m47.0s/3m10.0s

running (0m48.0s), 90/90 VUs, 12420 complete and 0 interrupted iterations
ramp_load   [  25% ] 90/90 VUs  0m48.0s/3m10.0s

running (0m49.0s), 90/90 VUs, 12722 complete and 0 interrupted iterations
ramp_load   [  26% ] 90/90 VUs  0m49.0s/3m10.0s

running (0m50.0s), 90/90 VUs, 13027 complete and 0 interrupted iterations
ramp_load   [  26% ] 90/90 VUs  0m50.0s/3m10.0s

running (0m51.0s), 90/90 VUs, 13346 complete and 0 interrupted iterations
ramp_load   [  27% ] 90/90 VUs  0m51.0s/3m10.0s

running (0m52.0s), 90/90 VUs, 13657 complete and 0 interrupted iterations
ramp_load   [  27% ] 90/90 VUs  0m52.0s/3m10.0s

running (0m53.0s), 90/90 VUs, 13984 complete and 0 interrupted iterations
ramp_load   [  28% ] 90/90 VUs  0m53.0s/3m10.0s

running (0m54.0s), 90/90 VUs, 14294 complete and 0 interrupted iterations
ramp_load   [  28% ] 90/90 VUs  0m54.0s/3m10.0s

running (0m55.0s), 90/90 VUs, 14608 complete and 0 interrupted iterations
ramp_load   [  29% ] 90/90 VUs  0m55.0s/3m10.0s

running (0m56.0s), 90/90 VUs, 14926 complete and 0 interrupted iterations
ramp_load   [  29% ] 90/90 VUs  0m56.0s/3m10.0s

running (0m57.0s), 90/90 VUs, 15239 complete and 0 interrupted iterations
ramp_load   [  30% ] 90/90 VUs  0m57.0s/3m10.0s

running (0m58.0s), 90/90 VUs, 15565 complete and 0 interrupted iterations
ramp_load   [  31% ] 90/90 VUs  0m58.0s/3m10.0s

running (0m59.0s), 90/90 VUs, 15899 complete and 0 interrupted iterations
ramp_load   [  31% ] 90/90 VUs  0m59.0s/3m10.0s

running (1m00.0s), 90/90 VUs, 16197 complete and 0 interrupted iterations
ramp_load   [  32% ] 90/90 VUs  1m00.0s/3m10.0s

running (1m01.0s), 90/90 VUs, 16496 complete and 0 interrupted iterations
ramp_load   [  32% ] 90/90 VUs  1m01.0s/3m10.0s

running (1m02.0s), 90/90 VUs, 16811 complete and 0 interrupted iterations
ramp_load   [  33% ] 90/90 VUs  1m02.0s/3m10.0s

running (1m03.0s), 90/90 VUs, 17114 complete and 0 interrupted iterations
ramp_load   [  33% ] 90/90 VUs  1m03.0s/3m10.0s

running (1m04.0s), 90/90 VUs, 17420 complete and 0 interrupted iterations
ramp_load   [  34% ] 90/90 VUs  1m04.0s/3m10.0s

running (1m05.0s), 90/90 VUs, 17737 complete and 0 interrupted iterations
ramp_load   [  34% ] 90/90 VUs  1m05.0s/3m10.0s

running (1m06.0s), 90/90 VUs, 18054 complete and 0 interrupted iterations
ramp_load   [  35% ] 90/90 VUs  1m06.0s/3m10.0s

running (1m07.0s), 90/90 VUs, 18371 complete and 0 interrupted iterations
ramp_load   [  35% ] 90/90 VUs  1m07.0s/3m10.0s

running (1m08.0s), 90/90 VUs, 18666 complete and 0 interrupted iterations
ramp_load   [  36% ] 90/90 VUs  1m08.0s/3m10.0s

running (1m09.0s), 90/90 VUs, 18969 complete and 0 interrupted iterations
ramp_load   [  36% ] 90/90 VUs  1m09.0s/3m10.0s

running (1m10.0s), 90/90 VUs, 19292 complete and 0 interrupted iterations
ramp_load   [  37% ] 90/90 VUs  1m10.0s/3m10.0s

running (1m11.0s), 90/90 VUs, 19615 complete and 0 interrupted iterations
ramp_load   [  37% ] 90/90 VUs  1m11.0s/3m10.0s

running (1m12.0s), 90/90 VUs, 19932 complete and 0 interrupted iterations
ramp_load   [  38% ] 90/90 VUs  1m12.0s/3m10.0s

running (1m13.0s), 90/90 VUs, 20247 complete and 0 interrupted iterations
ramp_load   [  38% ] 90/90 VUs  1m13.0s/3m10.0s

running (1m14.0s), 90/90 VUs, 20534 complete and 0 interrupted iterations
ramp_load   [  39% ] 90/90 VUs  1m14.0s/3m10.0s

running (1m15.0s), 90/90 VUs, 20814 complete and 0 interrupted iterations
ramp_load   [  39% ] 90/90 VUs  1m15.0s/3m10.0s

running (1m16.0s), 90/90 VUs, 21115 complete and 0 interrupted iterations
ramp_load   [  40% ] 90/90 VUs  1m16.0s/3m10.0s

running (1m17.0s), 90/90 VUs, 21419 complete and 0 interrupted iterations
ramp_load   [  41% ] 90/90 VUs  1m17.0s/3m10.0s

running (1m18.0s), 90/90 VUs, 21744 complete and 0 interrupted iterations
ramp_load   [  41% ] 90/90 VUs  1m18.0s/3m10.0s

running (1m19.0s), 90/90 VUs, 22062 complete and 0 interrupted iterations
ramp_load   [  42% ] 90/90 VUs  1m19.0s/3m10.0s

running (1m20.0s), 90/90 VUs, 22382 complete and 0 interrupted iterations
ramp_load   [  42% ] 90/90 VUs  1m20.0s/3m10.0s

running (1m21.0s), 90/90 VUs, 22698 complete and 0 interrupted iterations
ramp_load   [  43% ] 90/90 VUs  1m21.0s/3m10.0s

running (1m22.0s), 90/90 VUs, 22996 complete and 0 interrupted iterations
ramp_load   [  43% ] 90/90 VUs  1m22.0s/3m10.0s

running (1m23.0s), 90/90 VUs, 23294 complete and 0 interrupted iterations
ramp_load   [  44% ] 90/90 VUs  1m23.0s/3m10.0s

running (1m24.0s), 90/90 VUs, 23546 complete and 0 interrupted iterations
ramp_load   [  44% ] 90/90 VUs  1m24.0s/3m10.0s

running (1m25.0s), 90/90 VUs, 23841 complete and 0 interrupted iterations
ramp_load   [  45% ] 90/90 VUs  1m25.0s/3m10.0s

running (1m26.0s), 90/90 VUs, 24160 complete and 0 interrupted iterations
ramp_load   [  45% ] 90/90 VUs  1m26.0s/3m10.0s

running (1m27.0s), 90/90 VUs, 24459 complete and 0 interrupted iterations
ramp_load   [  46% ] 90/90 VUs  1m27.0s/3m10.0s

running (1m28.0s), 90/90 VUs, 24739 complete and 0 interrupted iterations
ramp_load   [  46% ] 90/90 VUs  1m28.0s/3m10.0s

running (1m29.0s), 90/90 VUs, 25030 complete and 0 interrupted iterations
ramp_load   [  47% ] 90/90 VUs  1m29.0s/3m10.0s

running (1m30.0s), 90/90 VUs, 25322 complete and 0 interrupted iterations
ramp_load   [  47% ] 90/90 VUs  1m30.0s/3m10.0s

running (1m31.0s), 90/90 VUs, 25622 complete and 0 interrupted iterations
ramp_load   [  48% ] 90/90 VUs  1m31.0s/3m10.0s

running (1m32.0s), 90/90 VUs, 25925 complete and 0 interrupted iterations
ramp_load   [  48% ] 90/90 VUs  1m32.0s/3m10.0s

running (1m33.0s), 90/90 VUs, 26232 complete and 0 interrupted iterations
ramp_load   [  49% ] 90/90 VUs  1m33.0s/3m10.0s

running (1m34.0s), 90/90 VUs, 26546 complete and 0 interrupted iterations
ramp_load   [  49% ] 90/90 VUs  1m34.0s/3m10.0s

running (1m35.0s), 90/90 VUs, 26863 complete and 0 interrupted iterations
ramp_load   [  50% ] 90/90 VUs  1m35.0s/3m10.0s

running (1m36.0s), 90/90 VUs, 27169 complete and 0 interrupted iterations
ramp_load   [  51% ] 90/90 VUs  1m36.0s/3m10.0s

running (1m37.0s), 90/90 VUs, 27470 complete and 0 interrupted iterations
ramp_load   [  51% ] 90/90 VUs  1m37.0s/3m10.0s

running (1m38.0s), 90/90 VUs, 27778 complete and 0 interrupted iterations
ramp_load   [  52% ] 90/90 VUs  1m38.0s/3m10.0s

running (1m39.0s), 90/90 VUs, 28050 complete and 0 interrupted iterations
ramp_load   [  52% ] 90/90 VUs  1m39.0s/3m10.0s

running (1m40.0s), 90/90 VUs, 28367 complete and 0 interrupted iterations
ramp_load   [  53% ] 90/90 VUs  1m40.0s/3m10.0s

running (1m41.0s), 90/90 VUs, 28635 complete and 0 interrupted iterations
ramp_load   [  53% ] 90/90 VUs  1m41.0s/3m10.0s

running (1m42.0s), 90/90 VUs, 28912 complete and 0 interrupted iterations
ramp_load   [  54% ] 90/90 VUs  1m42.0s/3m10.0s

running (1m43.0s), 90/90 VUs, 29197 complete and 0 interrupted iterations
ramp_load   [  54% ] 90/90 VUs  1m43.0s/3m10.0s

running (1m44.0s), 90/90 VUs, 29494 complete and 0 interrupted iterations
ramp_load   [  55% ] 90/90 VUs  1m44.0s/3m10.0s

running (1m45.0s), 90/90 VUs, 29797 complete and 0 interrupted iterations
ramp_load   [  55% ] 90/90 VUs  1m45.0s/3m10.0s

running (1m46.0s), 90/90 VUs, 30112 complete and 0 interrupted iterations
ramp_load   [  56% ] 90/90 VUs  1m46.0s/3m10.0s

running (1m47.0s), 90/90 VUs, 30387 complete and 0 interrupted iterations
ramp_load   [  56% ] 90/90 VUs  1m47.0s/3m10.0s

running (1m48.0s), 90/90 VUs, 30668 complete and 0 interrupted iterations
ramp_load   [  57% ] 90/90 VUs  1m48.0s/3m10.0s

running (1m49.0s), 90/90 VUs, 30972 complete and 0 interrupted iterations
ramp_load   [  57% ] 90/90 VUs  1m49.0s/3m10.0s

running (1m50.0s), 90/90 VUs, 31249 complete and 0 interrupted iterations
ramp_load   [  58% ] 90/90 VUs  1m50.0s/3m10.0s

running (1m51.0s), 90/90 VUs, 31546 complete and 0 interrupted iterations
ramp_load   [  58% ] 90/90 VUs  1m51.0s/3m10.0s

running (1m52.0s), 90/90 VUs, 31837 complete and 0 interrupted iterations
ramp_load   [  59% ] 90/90 VUs  1m52.0s/3m10.0s

running (1m53.0s), 90/90 VUs, 32152 complete and 0 interrupted iterations
ramp_load   [  59% ] 90/90 VUs  1m53.0s/3m10.0s

running (1m54.0s), 90/90 VUs, 32458 complete and 0 interrupted iterations
ramp_load   [  60% ] 90/90 VUs  1m54.0s/3m10.0s

running (1m55.0s), 90/90 VUs, 32775 complete and 0 interrupted iterations
ramp_load   [  61% ] 90/90 VUs  1m55.0s/3m10.0s

running (1m56.0s), 90/90 VUs, 33082 complete and 0 interrupted iterations
ramp_load   [  61% ] 90/90 VUs  1m56.0s/3m10.0s

running (1m57.0s), 90/90 VUs, 33367 complete and 0 interrupted iterations
ramp_load   [  62% ] 90/90 VUs  1m57.0s/3m10.0s

running (1m58.0s), 90/90 VUs, 33654 complete and 0 interrupted iterations
ramp_load   [  62% ] 90/90 VUs  1m58.0s/3m10.0s

running (1m59.0s), 90/90 VUs, 33956 complete and 0 interrupted iterations
ramp_load   [  63% ] 90/90 VUs  1m59.0s/3m10.0s

running (2m00.0s), 90/90 VUs, 34236 complete and 0 interrupted iterations
ramp_load   [  63% ] 90/90 VUs  2m00.0s/3m10.0s

running (2m01.0s), 90/90 VUs, 34562 complete and 0 interrupted iterations
ramp_load   [  64% ] 90/90 VUs  2m01.0s/3m10.0s

running (2m02.0s), 90/90 VUs, 34833 complete and 0 interrupted iterations
ramp_load   [  64% ] 90/90 VUs  2m02.0s/3m10.0s

running (2m03.0s), 90/90 VUs, 35124 complete and 0 interrupted iterations
ramp_load   [  65% ] 90/90 VUs  2m03.0s/3m10.0s

running (2m04.0s), 90/90 VUs, 35404 complete and 0 interrupted iterations
ramp_load   [  65% ] 90/90 VUs  2m04.0s/3m10.0s

running (2m05.0s), 90/90 VUs, 35691 complete and 0 interrupted iterations
ramp_load   [  66% ] 90/90 VUs  2m05.0s/3m10.0s

running (2m06.0s), 90/90 VUs, 35992 complete and 0 interrupted iterations
ramp_load   [  66% ] 90/90 VUs  2m06.0s/3m10.0s

running (2m07.0s), 90/90 VUs, 36294 complete and 0 interrupted iterations
ramp_load   [  67% ] 90/90 VUs  2m07.0s/3m10.0s

running (2m08.0s), 90/90 VUs, 36604 complete and 0 interrupted iterations
ramp_load   [  67% ] 90/90 VUs  2m08.0s/3m10.0s

running (2m09.0s), 90/90 VUs, 36910 complete and 0 interrupted iterations
ramp_load   [  68% ] 90/90 VUs  2m09.0s/3m10.0s

running (2m10.0s), 90/90 VUs, 37210 complete and 0 interrupted iterations
ramp_load   [  68% ] 90/90 VUs  2m10.0s/3m10.0s

running (2m11.0s), 90/90 VUs, 37514 complete and 0 interrupted iterations
ramp_load   [  69% ] 90/90 VUs  2m11.0s/3m10.0s

running (2m12.0s), 90/90 VUs, 37808 complete and 0 interrupted iterations
ramp_load   [  69% ] 90/90 VUs  2m12.0s/3m10.0s

running (2m13.0s), 90/90 VUs, 38105 complete and 0 interrupted iterations
ramp_load   [  70% ] 90/90 VUs  2m13.0s/3m10.0s

running (2m14.0s), 90/90 VUs, 38423 complete and 0 interrupted iterations
ramp_load   [  71% ] 90/90 VUs  2m14.0s/3m10.0s

running (2m15.0s), 90/90 VUs, 38722 complete and 0 interrupted iterations
ramp_load   [  71% ] 90/90 VUs  2m15.0s/3m10.0s

running (2m16.0s), 90/90 VUs, 39021 complete and 0 interrupted iterations
ramp_load   [  72% ] 90/90 VUs  2m16.0s/3m10.0s

running (2m17.0s), 90/90 VUs, 39322 complete and 0 interrupted iterations
ramp_load   [  72% ] 90/90 VUs  2m17.0s/3m10.0s

running (2m18.0s), 90/90 VUs, 39608 complete and 0 interrupted iterations
ramp_load   [  73% ] 90/90 VUs  2m18.0s/3m10.0s

running (2m19.0s), 90/90 VUs, 39888 complete and 0 interrupted iterations
ramp_load   [  73% ] 90/90 VUs  2m19.0s/3m10.0s

running (2m20.0s), 90/90 VUs, 40175 complete and 0 interrupted iterations
ramp_load   [  74% ] 90/90 VUs  2m20.0s/3m10.0s

running (2m21.0s), 90/90 VUs, 40458 complete and 0 interrupted iterations
ramp_load   [  74% ] 90/90 VUs  2m21.0s/3m10.0s

running (2m22.0s), 90/90 VUs, 40759 complete and 0 interrupted iterations
ramp_load   [  75% ] 90/90 VUs  2m22.0s/3m10.0s

running (2m23.0s), 90/90 VUs, 41064 complete and 0 interrupted iterations
ramp_load   [  75% ] 90/90 VUs  2m23.0s/3m10.0s

running (2m24.0s), 90/90 VUs, 41281 complete and 0 interrupted iterations
ramp_load   [  76% ] 90/90 VUs  2m24.0s/3m10.0s

running (2m25.0s), 90/90 VUs, 41542 complete and 0 interrupted iterations
ramp_load   [  76% ] 90/90 VUs  2m25.0s/3m10.0s

running (2m26.0s), 90/90 VUs, 41803 complete and 0 interrupted iterations
ramp_load   [  77% ] 90/90 VUs  2m26.0s/3m10.0s

running (2m27.0s), 90/90 VUs, 42085 complete and 0 interrupted iterations
ramp_load   [  77% ] 90/90 VUs  2m27.0s/3m10.0s

running (2m28.0s), 90/90 VUs, 42362 complete and 0 interrupted iterations
ramp_load   [  78% ] 90/90 VUs  2m28.0s/3m10.0s

running (2m29.0s), 90/90 VUs, 42662 complete and 0 interrupted iterations
ramp_load   [  78% ] 90/90 VUs  2m29.0s/3m10.0s

running (2m30.0s), 90/90 VUs, 42932 complete and 0 interrupted iterations
ramp_load   [  79% ] 90/90 VUs  2m30.0s/3m10.0s

running (2m31.0s), 90/90 VUs, 43198 complete and 0 interrupted iterations
ramp_load   [  79% ] 90/90 VUs  2m31.0s/3m10.0s

running (2m32.0s), 90/90 VUs, 43477 complete and 0 interrupted iterations
ramp_load   [  80% ] 90/90 VUs  2m32.0s/3m10.0s

running (2m33.0s), 90/90 VUs, 43756 complete and 0 interrupted iterations
ramp_load   [  81% ] 90/90 VUs  2m33.0s/3m10.0s

running (2m34.0s), 90/90 VUs, 44031 complete and 0 interrupted iterations
ramp_load   [  81% ] 90/90 VUs  2m34.0s/3m10.0s

running (2m35.0s), 90/90 VUs, 44302 complete and 0 interrupted iterations
ramp_load   [  82% ] 90/90 VUs  2m35.0s/3m10.0s

running (2m36.0s), 90/90 VUs, 44597 complete and 0 interrupted iterations
ramp_load   [  82% ] 90/90 VUs  2m36.0s/3m10.0s

running (2m37.0s), 90/90 VUs, 44897 complete and 0 interrupted iterations
ramp_load   [  83% ] 90/90 VUs  2m37.0s/3m10.0s

running (2m38.0s), 90/90 VUs, 45185 complete and 0 interrupted iterations
ramp_load   [  83% ] 90/90 VUs  2m38.0s/3m10.0s

running (2m39.0s), 90/90 VUs, 45465 complete and 0 interrupted iterations
ramp_load   [  84% ] 90/90 VUs  2m39.0s/3m10.0s

running (2m40.0s), 90/90 VUs, 45747 complete and 0 interrupted iterations
ramp_load   [  84% ] 90/90 VUs  2m40.0s/3m10.0s

running (2m41.0s), 88/90 VUs, 46014 complete and 0 interrupted iterations
ramp_load   [  85% ] 88/90 VUs  2m41.0s/3m10.0s

running (2m42.0s), 85/90 VUs, 46320 complete and 0 interrupted iterations
ramp_load   [  85% ] 85/90 VUs  2m42.0s/3m10.0s

running (2m43.0s), 82/90 VUs, 46624 complete and 0 interrupted iterations
ramp_load   [  86% ] 82/90 VUs  2m43.0s/3m10.0s

running (2m44.0s), 79/90 VUs, 46926 complete and 0 interrupted iterations
ramp_load   [  86% ] 79/90 VUs  2m44.0s/3m10.0s

running (2m45.0s), 76/90 VUs, 47225 complete and 0 interrupted iterations
ramp_load   [  87% ] 76/90 VUs  2m45.0s/3m10.0s

running (2m46.0s), 73/90 VUs, 47510 complete and 0 interrupted iterations
ramp_load   [  87% ] 73/90 VUs  2m46.0s/3m10.0s

running (2m47.0s), 70/90 VUs, 47787 complete and 0 interrupted iterations
ramp_load   [  88% ] 70/90 VUs  2m47.0s/3m10.0s

running (2m48.0s), 67/90 VUs, 48089 complete and 0 interrupted iterations
ramp_load   [  88% ] 67/90 VUs  2m48.0s/3m10.0s

running (2m49.0s), 64/90 VUs, 48322 complete and 0 interrupted iterations
ramp_load   [  89% ] 64/90 VUs  2m49.0s/3m10.0s

running (2m50.0s), 61/90 VUs, 48573 complete and 0 interrupted iterations
ramp_load   [  89% ] 61/90 VUs  2m50.0s/3m10.0s

running (2m51.0s), 58/90 VUs, 48841 complete and 0 interrupted iterations
ramp_load   [  90% ] 58/90 VUs  2m51.0s/3m10.0s

running (2m52.0s), 55/90 VUs, 49120 complete and 0 interrupted iterations
ramp_load   [  91% ] 55/90 VUs  2m52.0s/3m10.0s

running (2m53.0s), 52/90 VUs, 49414 complete and 0 interrupted iterations
ramp_load   [  91% ] 52/90 VUs  2m53.0s/3m10.0s

running (2m54.0s), 49/90 VUs, 49684 complete and 0 interrupted iterations
ramp_load   [  92% ] 49/90 VUs  2m54.0s/3m10.0s

running (2m55.0s), 46/90 VUs, 49945 complete and 0 interrupted iterations
ramp_load   [  92% ] 46/90 VUs  2m55.0s/3m10.0s

running (2m56.0s), 43/90 VUs, 50239 complete and 0 interrupted iterations
ramp_load   [  93% ] 43/90 VUs  2m56.0s/3m10.0s

running (2m57.0s), 40/90 VUs, 50534 complete and 0 interrupted iterations
ramp_load   [  93% ] 40/90 VUs  2m57.0s/3m10.0s

running (2m58.0s), 37/90 VUs, 50753 complete and 0 interrupted iterations
ramp_load   [  94% ] 37/90 VUs  2m58.0s/3m10.0s

running (2m59.0s), 34/90 VUs, 51014 complete and 0 interrupted iterations
ramp_load   [  94% ] 34/90 VUs  2m59.0s/3m10.0s

running (3m00.0s), 31/90 VUs, 51267 complete and 0 interrupted iterations
ramp_load   [  95% ] 31/90 VUs  3m00.0s/3m10.0s

running (3m01.0s), 28/90 VUs, 51509 complete and 0 interrupted iterations
ramp_load   [  95% ] 28/90 VUs  3m01.0s/3m10.0s

running (3m02.0s), 25/90 VUs, 51737 complete and 0 interrupted iterations
ramp_load   [  96% ] 25/90 VUs  3m02.0s/3m10.0s

running (3m03.0s), 22/90 VUs, 51942 complete and 0 interrupted iterations
ramp_load   [  96% ] 22/90 VUs  3m03.0s/3m10.0s

running (3m04.0s), 19/90 VUs, 52124 complete and 0 interrupted iterations
ramp_load   [  97% ] 19/90 VUs  3m04.0s/3m10.0s

running (3m05.0s), 16/90 VUs, 52281 complete and 0 interrupted iterations
ramp_load   [  97% ] 16/90 VUs  3m05.0s/3m10.0s

running (3m06.0s), 13/90 VUs, 52413 complete and 0 interrupted iterations
ramp_load   [  98% ] 13/90 VUs  3m06.0s/3m10.0s

running (3m07.0s), 10/90 VUs, 52516 complete and 0 interrupted iterations
ramp_load   [  98% ] 10/90 VUs  3m07.0s/3m10.0s

running (3m08.0s), 07/90 VUs, 52591 complete and 0 interrupted iterations
ramp_load   [  99% ] 07/90 VUs  3m08.0s/3m10.0s

running (3m09.0s), 04/90 VUs, 52641 complete and 0 interrupted iterations
ramp_load   [  99% ] 04/90 VUs  3m09.0s/3m10.0s

running (3m10.0s), 01/90 VUs, 52662 complete and 0 interrupted iterations
ramp_load   [ 100% ] 01/90 VUs  3m10.0s/3m10.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1500' p(95)=230.39ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 157989  831.479522/s
    checks_succeeded...: 100.00% 157989 out of 157989
    checks_failed......: 0.00%   0 out of 157989

    ✓ status 200
    ✓ response has userId
    ✓ response has recommendations

    HTTP
    http_req_duration..............: avg=158.72ms min=2.22ms   med=176.06ms max=1.89s p(90)=216.4ms  p(95)=230.39ms
      { expected_response:true }...: avg=158.72ms min=2.22ms   med=176.06ms max=1.89s p(90)=216.4ms  p(95)=230.39ms
    http_req_failed................: 0.00%  0 out of 52663
    http_reqs......................: 52663  277.159841/s

    EXECUTION
    iteration_duration.............: avg=268.66ms min=105.44ms med=286.05ms max=2s    p(90)=326.87ms p(95)=341.22ms
    iterations.....................: 52663  277.159841/s
    vus............................: 1      min=1          max=90
    vus_max........................: 90     min=90         max=90

    NETWORK
    data_received..................: 1.4 GB 7.4 MB/s
    data_sent......................: 4.8 MB 25 kB/s



running (3m10.0s), 00/90 VUs, 52663 complete and 0 interrupted iterations
ramp_load ✓ [ 100% ] 00/90 VUs  3m10s